exercise-optimisation/step3/heatedPlate_template/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 300;
    }

    outlet
    {
        type            zeroGradient;
    }

    wallUpper
    {
        type            zeroGradient;
    }

    wallPlate
    {
        type            zeroGradient;
    }

    wallLower
    {
        type            fixedValueSection;
        BCValue         350;
        x0              0.042;
        x1              0.052;
    }

    "front|back"
    {
        type            empty;
    }
}

// ************************************************************************* //
